/*
*********************************************************************************************************
*	                                  
*	
*	文件名称 : delay.c
*	说    明 : 延时函数
*
*********************************************************************************************************
*/
#include "delay.h"

vu32 DelayTime;
/****************************************************************************
* 名    称：Delay_Init
* 功    能：滴答延时初始化
* 入口参数：无
* 出口参数：无
****************************************************************************/ 
void Delay_Init(void)
{
	 SYSTICK_ClockSourceConfig(SYSTICK_SRC_STCLK);       // Default : CK_SYS/8
     SYSTICK_SetReloadValue(SystemCoreClock / 8 / 1000); // (CK_SYS/8/1000) = 1ms on chip
     SYSTICK_IntConfig(ENABLE);              
}
/****************************************************************************
* 名    称：delay_ms
* 功    能：毫秒延时函数
* 入口参数：nTime
* 出口参数：无
* 说    明：
* 调用方法：无 
****************************************************************************/ 
void delay_ms(u32 nTime)
{

  SYSTICK_CounterCmd(SYSTICK_COUNTER_ENABLE);

  DelayTime = nTime;

  while(DelayTime != 0);

  /* Disable SysTick Counter */
  SYSTICK_CounterCmd(SYSTICK_COUNTER_DISABLE);
  /* Clear SysTick Counter */
  SYSTICK_CounterCmd(SYSTICK_COUNTER_CLEAR);
	
}

/********************************************************************************************************
* 名    称：Sket_Delayus(u32 nus)
* 功    能：粗略的微秒延时函数
* 入口参数：u32  nus
* 出口参数：无
********************************************************************************************************/ 
void Sket_Delayus(u32 nus)
{    
   u16 i=0;  
   while(nus--)
   {
      i=10;  //自己定义
      while(i--) ;    
   }
}
/********************************************************************************************************
* 名    称：Sket_Delayus(u32 nus)
* 功    能：粗略的毫秒延时函数
* 入口参数：u32  nus
* 出口参数：无
********************************************************************************************************/ 
void Sket_Delayms(u16 nms)
{    
   u16 i=0;  
   while(nms--)
   {
      i=12000;  //自己定义
      while(i--) ;    
   }
}


/********************************************************************************************************
**                            End Of File
********************************************************************************************************/

